xml/Enums/ИИА_АвторСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИИА_АвторСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Система</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_ТипСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИИА_ТипСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/CommonModules/ИИА_Summary/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СгенерироватьSummary(СсылкаДиалога) Экспорт

	Попытка

		Диалог = СсылкаДиалога.ПолучитьОбъект();

		Если ИИА_TypedPlan.ПланЗавершен(СсылкаДиалога) Тогда
			План = ИИА_TypedPlan.ПолучитьTypedPlan(СсылкаДиалога);
			ТекстSummaryПлана = СформироватьSummaryПоTypedPlan(План);
			Если НЕ ПустаяСтрока(ТекстSummaryПлана) Тогда
				Возврат ТекстSummaryПлана;
			КонецЕсли;
		КонецЕсли;

		// Получаем все сообщения диалога для контекста
		МассивИстории = ИИА_Сервер.ПолучитьСообщенияДиалога(СсылкаДиалога, 30);
		История = ИИА_Сервер.ПреобразоватьМассивСообщенийВТаблицу(МассивИстории);

		// Получаем информацию о созданных/измененных объектах
		ТекстИзмененныхОбъектов = "";
		Если Диалог.ИзмененныеОбъекты.Количество() > 0 Тогда
			ТекстИзмененныхОбъектов = "Созданные/измененные объекты:" + Символы.ПС;
			Для Каждого СтрокаИзмененныхОбъектов Из Диалог.ИзмененныеОбъекты Цикл
				Если ЗначениеЗаполнено(СтрокаИзмененныхОбъектов.СсылкаНаОбъект) Тогда
					ТекстИзмененныхОбъектов = ТекстИзмененныхОбъектов + "- " + СтрокаИзмененныхОбъектов.СсылкаНаОбъект + Символы.ПС;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ТекстИзмененныхОбъектов = "Объекты не создавались и не изменялись.";
		КонецЕсли;

		// Получаем все задачи пользователя из истории диалога
		ТекстЗадач = "";
		Для Каждого СтруктураСообщения Из МассивИстории Цикл
			Если СтруктураСообщения.Автор = Перечисления.ИИА_АвторСообщения.Пользователь Тогда
				ТекстЗадачи = СокрЛП(СтруктураСообщения.Текст);
				Если НЕ ПустаяСтрока(ТекстЗадачи) Тогда
					Если НЕ ПустаяСтрока(ТекстЗадач) Тогда
						ТекстЗадач = ТекстЗадач + Символы.ПС;
					КонецЕсли;
					ТекстЗадач = ТекстЗадач + ТекстЗадачи;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		// Извлекаем результаты выполнения DSL из системных сообщений
		ТекстРезультатовDSL = "";
		Для Индекс = 0 По МассивИстории.Количество() - 1 Цикл
			СтруктураСообщения = МассивИстории[Индекс];

			Если СтруктураСообщения.Автор = Перечисления.ИИА_АвторСообщения.ИИ
				И НЕ ПустаяСтрока(СтруктураСообщения.ТекстКода) Тогда

				Если Индекс + 1 < МассивИстории.Количество() Тогда
					СледующееСообщение = МассивИстории[Индекс + 1];
					Если СледующееСообщение.Автор = Перечисления.ИИА_АвторСообщения.Система
						И НЕ ПустаяСтрока(СледующееСообщение.Текст) Тогда

						ТекстРезультата = СокрЛП(СледующееСообщение.Текст);
						Если НЕ ПустаяСтрока(ТекстРезультата) Тогда
							Если НЕ ПустаяСтрока(ТекстРезультатовDSL) Тогда
								ТекстРезультатовDSL = ТекстРезультатовDSL + Символы.ПС;
							КонецЕсли;
							ТекстКодаДляSummary = СокрЛП(СтруктураСообщения.ТекстКода);
							Если СтрДлина(ТекстКодаДляSummary) > 1200 Тогда
								ТекстКодаДляSummary = Лев(ТекстКодаДляSummary, 1200) + "...(truncated)";
							КонецЕсли;
							Если СтрДлина(ТекстРезультата) > 2000 Тогда
								ТекстРезультата = Лев(ТекстРезультата, 2000) + "...(truncated)";
							КонецЕсли;
							ТекстРезультатовDSL = ТекстРезультатовDSL + "DSL-сценарий: " + ТекстКодаДляSummary + Символы.ПС;
							ТекстРезультатовDSL = ТекстРезультатовDSL + "Результат: " + ТекстРезультата;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		// Получаем настройки ИИ для пользователя диалога
		Пользователь = Диалог.Пользователь;
		ПараметрыИИ = ИИА_Сервер.ПолучитьНастройкиПользователя(Пользователь);
		ПараметрыИИ.Вставить("Пользователь", Пользователь);

		// Формируем промпт для генерации summary
		ПромптSummary = ИИА_Промты.СформироватьПромптРезюме(ТекстЗадач, ТекстИзмененныхОбъектов, ТекстРезультатовDSL);

		// Вызываем ИИ для генерации summary
		ОтветИИ = ИИА_Сервер.ВызватьИИССистемнымСообщением(СсылкаДиалога, "Чат", ПромптSummary, "", "text");

		ТекстSummary = "";
		Если ОтветИИ.Свойство("Текст") И НЕ ПустаяСтрока(ОтветИИ.Текст) Тогда
			ТекстSummary = ОтветИИ.Текст;
		ИначеЕсли ОтветИИ.Свойство("DSL") И НЕ ПустаяСтрока(ОтветИИ.DSL) Тогда
			ТекстSummary = ОтветИИ.DSL;
		КонецЕсли;

		Если СтрНачинаетсяС(СокрЛП(ТекстSummary), "{") Тогда
			Попытка
				Чтение = Новый ЧтениеJSON;
				Чтение.УстановитьСтроку(ТекстSummary);
				ДанныеJSON = ПрочитатьJSON(Чтение);
				Чтение.Закрыть();

				Если ТипЗнч(ДанныеJSON) = Тип("Структура") Тогда
					Если ДанныеJSON.Свойство("summary") Тогда
						ТекстSummary = ДанныеJSON.summary;
					ИначеЕсли ДанныеJSON.Свойство("text") Тогда
						ТекстSummary = ДанныеJSON.text;
					ИначеЕсли ДанныеJSON.Свойство("резюме") Тогда
						ТекстSummary = ДанныеJSON.резюме;
					КонецЕсли;
				КонецЕсли;
			Исключение
				ТекстОшибки = ОписаниеОшибки();
			КонецПопытки;
		КонецЕсли;

		Возврат ТекстSummary;

	Исключение
		Возврат "Ошибка при генерации summary: " + ОписаниеОшибки();
	КонецПопытки;

КонецФункции

Функция СформироватьSummaryПоTypedPlan(План)

	Если План = Неопределено Или НЕ План.Свойство("steps") Или План.steps.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;

	ЕстьПропущенныеШаги = ПланСодержитПропущенныеКритичныеШаги(План);
	ТекстSummary = ?(ЕстьПропущенныеШаги, "Задача не завершена.", "Задача выполнена успешно.");
	Если План.Свойство("goal") И НЕ ПустаяСтрока(Строка(План.goal)) Тогда
		ТекстSummary = ТекстSummary + " Задача: " + Строка(План.goal);
	КонецЕсли;

	ТекстSummary = ТекстSummary + Символы.ПС + Символы.ПС + "Выполненные шаги:";
	ТекстРезультатаДляПользователя = "";
	Для Каждого ШагПлана Из План.steps Цикл
		ЗаголовокШага = ?(ШагПлана.Свойство("title"), СокрЛП(Строка(ШагПлана.title)), "");
		РезультатШага = ?(ШагПлана.Свойство("result_summary"), СокрЛП(Строка(ШагПлана.result_summary)), "");
		Если ПустаяСтрока(ЗаголовокШага) Тогда
			ЗаголовокШага = ?(ШагПлана.Свойство("kind"), СокрЛП(Строка(ШагПлана.kind)), "Шаг плана");
		КонецЕсли;
		СтрокаSummary = "- " + ЗаголовокШага;
		Если НЕ ПустаяСтрока(РезультатШага) Тогда
			СтрокаSummary = СтрокаSummary + ": " + РезультатШага;
		Иначе
			СтрокаSummary = СтрокаSummary + ": выполнено успешно";
		КонецЕсли;
		Если СтрДлина(СтрокаSummary) > 1000 Тогда
			СтрокаSummary = Лев(СтрокаSummary, 1000) + "...";
		КонецЕсли;
		ТекстSummary = ТекстSummary + Символы.ПС + СтрокаSummary;

		ТекстРезультатаШага = ПолучитьПользовательскийТекстРезультатаШага(ШагПлана);
		Если НЕ ПустаяСтрока(ТекстРезультатаШага) Тогда
			ТекстРезультатаДляПользователя = ТекстРезультатаШага;
		КонецЕсли;
	КонецЦикла;

	Если НЕ ПустаяСтрока(ТекстРезультатаДляПользователя) Тогда
		Если СтрДлина(ТекстРезультатаДляПользователя) > 3000 Тогда
			ТекстРезультатаДляПользователя = Лев(ТекстРезультатаДляПользователя, 3000) + "...";
		КонецЕсли;
		ТекстSummary = ТекстSummary + Символы.ПС + Символы.ПС + "Результат:" + Символы.ПС + ТекстРезультатаДляПользователя;
	КонецЕсли;

	Если ЕстьПропущенныеШаги Тогда
		ТекстSummary = ТекстSummary + Символы.ПС + Символы.ПС + "Нужно продолжить выполнение: часть критичных шагов была пропущена, результата для пользователя нет.";
	КонецЕсли;

	Возврат ТекстSummary;

КонецФункции

Функция ПолучитьПользовательскийТекстРезультатаШага(ШагПлана)

	Если ШагПлана = Неопределено Или НЕ ШагПлана.Свойство("result_data") Тогда
		Возврат "";
	КонецЕсли;

	РезультатШага = ШагПлана.result_data;
	Если РезультатШага = Неопределено Или ТипЗнч(РезультатШага) <> Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;

	Текст = "";
	Если РезультатШага.Свойство("Сообщение") Тогда
		Текст = СокрЛП(Строка(РезультатШага.Сообщение));
	ИначеЕсли РезультатШага.Свойство("Данные") И ТипЗнч(РезультатШага.Данные) = Тип("Строка") Тогда
		Текст = СокрЛП(РезультатШага.Данные);
	КонецЕсли;

	Если ПустаяСтрока(Текст) Тогда
		Возврат "";
	КонецЕсли;

	ТекстВРег = ВРег(Текст);
	Если СтрНайти(ТекстВРег, "РЕЗУЛЬТАТ ЗАПРОСА") > 0
		ИЛИ СтрНайти(Текст, Символы.ПС) > 0 Тогда
		Возврат Текст;
	КонецЕсли;

	Возврат "";

КонецФункции

Функция ПланСодержитПропущенныеКритичныеШаги(План)

	Если План = Неопределено Или НЕ План.Свойство("steps") Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Каждого ШагПлана Из План.steps Цикл
		Если ШагПлана = Неопределено Или ТипЗнч(ШагПлана) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		Статус = ВРег(Строка(?(ШагПлана.Свойство("status"), ШагПлана.status, "")));
		Если Статус <> "SKIPPED" Тогда
			Продолжить;
		КонецЕсли;
		РезультатШага = ВРег(Строка(?(ШагПлана.Свойство("result_summary"), ШагПлана.result_summary, "")));
		ВидШага = ВРег(Строка(?(ШагПлана.Свойство("kind"), ШагПлана.kind, "")));
		Если СтрНайти(РезультатШага, "ЛИМИТ ИТЕРАЦИЙ") > 0
			ИЛИ ВидШага = "RUN_QUERY"
			ИЛИ ВидШага = "SHOW_INFO" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

Функция ИзвлечьSummaryИзТекста(Знач ИсходныйТекст) Экспорт

	ЧистыйТекст = "";

	ТекстБезЗаголовка = СтрЗаменить(ИсходныйТекст, "=== РЕЗЮМЕ ВЫПОЛНЕННОЙ РАБОТЫ ===", "");

	ПозНачалаJSON = СтрНайти(ТекстБезЗаголовка, "```json");
	ПозКонцаJSON = СтрНайти(ТекстБезЗаголовка, "```", НаправлениеПоиска.СКонца);

	Если ПозНачалаJSON > 0 И ПозКонцаJSON > ПозНачалаJSON Тогда
		Префикс = Лев(ТекстБезЗаголовка, ПозНачалаJSON - 1);
		СтрокаJSON = Сред(ТекстБезЗаголовка, ПозНачалаJSON + 7, ПозКонцаJSON - (ПозНачалаJSON + 7));

		Попытка
			Чтение = Новый ЧтениеJSON;
			Чтение.УстановитьСтроку(СтрокаJSON);
			ДанныеJSON = ПрочитатьJSON(Чтение);
			Чтение.Закрыть();

			Если ТипЗнч(ДанныеJSON) = Тип("Структура") И ДанныеJSON.Свойство("summary") Тогда
				ЧистыйТекст = СокрЛП(Префикс) + Символы.ПС + Символы.ПС + ДанныеJSON.summary;
			ИначеЕсли ТипЗнч(ДанныеJSON) = Тип("Соответствие") И ДанныеJSON.Получить("summary") <> Неопределено Тогда
				ЧистыйТекст = СокрЛП(Префикс) + Символы.ПС + Символы.ПС + ДанныеJSON.Получить("summary");
			Иначе
				ЧистыйТекст = ТекстБезЗаголовка;
			КонецЕсли;
		Исключение
			ЧистыйТекст = ТекстБезЗаголовка;
		КонецПопытки;
	Иначе
		ЧистыйТекст = ТекстБезЗаголовка;
	КонецЕсли;

	Возврат СокрЛП(ЧистыйТекст);

КонецФункции

Процедура ВыполнитьФинальнуюПроверкуИSummary(СсылкаДиалога) Экспорт

	ИИА_Сервер.ОчиститьКонтекстDSLДиалога(СсылкаДиалога);

	РезультатПроверки = ИИА_ВалидаторРезультата.ПроверитьРезультатВыполненияЗадачи(СсылкаДиалога);
	ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, РезультатПроверки.ПроверкаВыполнена, РезультатПроверки.Причина);

	ТекстSummary = СгенерироватьSummary(СсылкаДиалога);
	ИИА_Оркестратор.ПротоколироватьМетрикуСтадии(СсылкаДиалога, "Summarize", ТекущаяДата(), НЕ ПустаяСтрока(ТекстSummary), "");
	Если НЕ ПустаяСтрока(ТекстSummary) Тогда
		Дополнение = "";
		Если НЕ ПустаяСтрока(РезультатПроверки.Причина) Тогда
			Дополнение = Символы.ПС + Символы.ПС + "Проверка: " + РезультатПроверки.Причина;
		КонецЕсли;

		Если НЕ РезультатПроверки.ПроверкаВыполнена Тогда
			Диалог = СсылкаДиалога.ПолучитьОбъект();
			Если Диалог.ИзмененныеОбъекты.Количество() > 0 Тогда
				ТекстSummary = СтрЗаменить(ТекстSummary, "Задача выполнена успешно.", "Задача выполнена, требуется проверка результата.");
			Иначе
				ТекстSummary = СтрЗаменить(ТекстSummary, "Задача выполнена успешно.", "Задача не подтверждена.");
			КонецЕсли;
		КонецЕсли;

		ТекстSummary = ТекстSummary + Дополнение;

		ИИА_Сервер.ДобавитьСообщениеВДиалог(
			СсылкаДиалога,
			Перечисления.ИИА_АвторСообщения.Система,
			Перечисления.ИИА_ТипСообщения.Текст,
			"=== РЕЗЮМЕ ВЫПОЛНЕННОЙ РАБОТЫ ===" + Символы.ПС + Символы.ПС + ТекстSummary,
			"",
			"",
			0
		);
		// Явное уведомление о резюме с Сообщение в payload - на случай, если «НовоеСообщение» из фонового задания не дойдёт до клиента
		ПоследнийУИД = ИИА_Сервер.ПолучитьПоследнийУИДСообщенияДиалога(СсылкаДиалога);
		СообщениеРезюме = ИИА_Сервер.ПолучитьСообщениеПоУИД(СсылкаДиалога, ПоследнийУИД);
		ДопДанныеРезюме = ?(СообщениеРезюме <> Неопределено, Новый Структура("Сообщение", СообщениеРезюме), Неопределено);
		ИИА_Оркестратор.ОтправитьУведомление(СсылкаДиалога, "РезюмеДобавлено", ДопДанныеРезюме);
	Иначе
		// Запасное сообщение при ошибке или пустом ответе ИИ
		ИИА_Сервер.ДобавитьСообщениеВДиалог(
			СсылкаДиалога,
			Перечисления.ИИА_АвторСообщения.Система,
			Перечисления.ИИА_ТипСообщения.Текст,
			"=== РЕЗЮМЕ ВЫПОЛНЕННОЙ РАБОТЫ ===" + Символы.ПС + Символы.ПС + "Резюме не сформировано.",
			"",
			"",
			0
		);
		ПоследнийУИД = ИИА_Сервер.ПолучитьПоследнийУИДСообщенияДиалога(СсылкаДиалога);
		СообщениеРезюме = ИИА_Сервер.ПолучитьСообщениеПоУИД(СсылкаДиалога, ПоследнийУИД);
		ДопДанныеРезюме = ?(СообщениеРезюме <> Неопределено, Новый Структура("Сообщение", СообщениеРезюме), Неопределено);
		ИИА_Оркестратор.ОтправитьУведомление(СсылкаДиалога, "РезюмеДобавлено", ДопДанныеРезюме);
	КонецЕсли;

	// Отправляем финальное уведомление с Сообщение в payload - чтобы при перезагрузке чата резюме не исчезало
	ДопДанные = Новый Структура("Успех", РезультатПроверки.ПроверкаВыполнена);
	Если СообщениеРезюме <> Неопределено Тогда
		ДопДанные.Вставить("Сообщение", СообщениеРезюме);
	КонецЕсли;
	ИИА_Сервер.УведомитьОбОбновленииДиалога(СсылкаДиалога, "ЗадачаЗавершена", ДопДанные);

КонецПроцедуры

Функция ВыполнитьСтадиюSummarize(СсылкаДиалога) Экспорт
	Возврат ВыполнитьSummarizeSubgraph(СсылкаДиалога);
КонецФункции

Функция ВыполнитьSummarizeSubgraph(СсылкаДиалога) Экспорт
	ИИА_Сервер.ЗафиксироватьАктивныйПодграф(СсылкаДиалога, "SummarizeSubgraph", "enter");
	ВыполнитьФинальнуюПроверкуИSummary(СсылкаДиалога);
	УспехSummary = Ложь;
	ПоследнийУИД = ИИА_Сервер.ПолучитьПоследнийУИДСообщенияДиалога(СсылкаДиалога);
	ПоследнееСообщение = ИИА_Сервер.ПолучитьСообщениеПоУИД(СсылкаДиалога, ПоследнийУИД);
	Если ПоследнееСообщение <> Неопределено
		И ПоследнееСообщение.Свойство("Текст")
		И СтрНайти(Строка(ПоследнееСообщение.Текст), "РЕЗЮМЕ ВЫПОЛНЕННОЙ РАБОТЫ") > 0 Тогда
		УспехSummary = Истина;
	КонецЕсли;
	Возврат ИИА_RuntimeКонтракты.ПодготовитьРезультатПодграфаКВозврату(ИИА_RuntimeКонтракты.СоздатьРезультатПодграфа("SummarizeSubgraph", УспехSummary, "Summarize->Stop", Неопределено, Ложь, "continue", Неопределено, "", ?(УспехSummary, "summary_completed", "summary_failed"), "summarize_policy", ""));
КонецФункции

#КонецОбласти
